<template>
    <div id="big_box">
        <div id="title" style="width: 70%; text-align: left;">
            <p style="font-size: 40px;">{{ article.title }}</p>
            <div style="padding-top: 5px">
                <div>
                </div>
                <img src="https://cube.elemecdn.com/3/7c/3ea6beec64369c2642b92c6726f1epng.png" class="image"
                    style="height: 60px; float: left;" />
                <p style=" float: left;">{{ authorName }}</p>
            </div>
        </div>
        <hr style="width: 90%; margin-top: 10px; margin-bottom: 20px; border: 1px solid rgb(226 226 226); " />
        <div>
            <!-- <div id="main_part" v-html="article.content"> -->
            <div id="main_part" style="padding: 10px 100px;font-size: large; line-height: 2em;">
                想闻晚晚放的屁。
                晚晚羞红了脸，试图让气体出来的慢一点。然而肉肉的大腿和鼙鼓与晚晚坐的椅子紧紧地贴合在一起，尽管已经努力控制，依然发出了尴尬的声音。我就蹲在椅背后面，尽情地享受晚晚的气味。我将所有气体吸入肺中，又一点点呼出，感受着晚晚的气味反复鸿儒我的鼻腔。
                快端午节啦，在家休息的晚晚叫我陪她一起做粽子。第一步当然是准备糯米了，我说：“晚晚，咱们家没有糯米了怎么办呀。”晚晚歪在沙发上对我吼到：“超市里扫货！”
                从超市扫货归来，我问晚晚还需要准备什么，依旧在沙发上耍手机的晚晚没好气的对我大吼：“糖在窗上，准备艾草吧你！”
                你怎么懂我😠
                你听过《水母之歌》吗？🤨
                你看过《向晚生日会》吗？😒
                顶碗人能哭的地方只有厕所和晚晚的怀抱😔
                你知道是出自哪个女团吗？😭
                你知道拉胯抛瓦是什么意思吗😒
                你连向晚大魔王没有关注😠
                凭什么说你爱我！😡
                向晚是枝江的小才女😎
                向晚的直播间都是懂我和我一样热爱向晚的人🥰
                独特的轻松快乐的氛围，互动式直播😁
                让我看直播快乐加倍🥳
                那些生命中灰暗的日子🤕
                是向晚大魔王激励我前行😇
                A-SOUL还有三位有趣的姐姐😍
                让我保持对新鲜事物好奇心和渴望🤩
                最终重要的是✋
                看向晚直播永远轻松快乐！😤​
                可就算是大小姐，也需要练舞，她的脚踝膝盖不好，在练舞鞋的选择上往往包裹性优先，取而代之的便是透气性下降，这正是晚晚有时脚臭的原因。一下午的舞蹈练习下来，晚晚不仅身上香汗淋漓，汗水不仅沾湿了贴身的内衣，鞋子里更是成为了滋生汗液的温床。每当她脱下舞鞋，甚至都冒着几缕白雾，向晚这时往往都会张红了脸，因为害羞，而我也涨红了脸，因为兴奋，此时正是品味晚晚的小臭jio最好的时机。先用鼻子对着晚晚的鞋子狠狠地吸上一口，把袜子轻轻地脱下来放在一边，不要急着洗，再用舌头进行试探般的舔舐，把最浓郁的汗液一点点用舌头细细品味，之后才是重点，虽然晚晚爱干净，常剪指甲，可有时脚趾甲还是有藏污纳垢可能，那里可是脚臭民所热爱的精华部分，可不能忘记品味。舔过jiojio之后，也不要忘记袜子，晚上塞在嘴里睡觉也未尝不是极佳的选择，整晚都能体验晚晚的jiojio的味道。
                晚晚，我承认你有几分姿色，如果我20岁，我会毫不犹豫追你。如果我三十岁，我会放弃家庭跟你在一起。但是真的很对不起，我现在才六年级，​好难啊我有点看不​懂不过我有亲身体会，这种题目要自己做 要不然还是会不懂的要不你去
                问问老师父母或同学​。
                我要和向晚左爱我要和向晚左爱我要和向晚左爱我要和向晚左爱我要和向晚左爱我要和向晚左爱
                晚晚可以踩我的🐮🐮吗？
                晚晚可以骂我吗？
                我要和向晚左爱我要和向晚左爱我要和向晚左爱我要和向晚左爱我要和向晚左爱我要和向晚左爱
                刚刚称了一下体重竟然轻了2斤，结果是向晚给我的项圈忘记带了，无语，刚刚回家的路上真恐怖啊
                ，我只想买点零食，结果差点吓死，进了超市以后总感觉有几个男的跟着我，我走哪他们跟哪，我想走快点结果其中一个男的过来拍我肩膀，我顿时一慌，然后那男的看看我说了句 "抱歉认错人了"
                ，我想那我继续买东西吧，然后过会我听到他小声地跟其他人说：“我靠真的是向晚的狗啊！ ”昨天考试，我坐在向晚前面，一直捂着卷子不让她抄，我哭着说不要抄了不要抄了，还是被向晚在后面抄到了😭😭😭
                好想被晚晚逼着喝饮料啊，她逼我喝我就不喝，她就把我摁在怀里使劲勒我，开始还觉得挺乐甚至偷偷伸舌头舔👅，但是越勒越紧整得快喘不过气了，我情急之下逮着小年糕就是一口(🤤)，晚晚又羞又气，左手捂着小年糕涨红着脸追着我打了半天，最后我不得已喝一口青柠味的饮料把晚晚哄好了，现在胳膊上都是被掐紫的印子，真是任性的女孩子啊😓她逼我喝我就不喝，她就把我摁在怀里使劲勒我，开始还觉得挺乐甚至偷偷伸舌头舔👅，但是越勒越紧整得快喘不过气了，我情急之下逮着小年糕就是一口(🤤)，晚晚又羞又气，左手捂着小年糕涨红着脸追着我打了半天，最后我不得已喝一口青柠味的饮料把晚晚哄好了，现在胳膊上都是被掐紫的印子，真是任性的女孩呢😓
                多想成为晚晚的小男友
                这样就可以和晚晚朝云暮雨十四天
                每天起床扒开她睡衣直接把她炒醒，
                吃完早饭趁她懒洋洋躺椅子上小炒一发
                上午闲的没事把她按沙发上爆炒
                中午吃完饭消消食把她软软香香的身子抱起来猛炒
                下午和她打游戏时给她扣扣
                晚上吃完晚饭一边洗碗一边让她在下面给我口
                躺床上睡不着狠狠地压在身下爆炒，炒到睡着为止
                好想趁这些天和她造好多小小晚😔😔
                向晚如果是男孩子就好了，这样我就能马上和向晚结婚让我每天都在他朝九晚五的工作中用心照顾他。在早上就比他提前一小时起来用铁链把向晚绑在床上，做好了早饭就把他推醒做洗漱，然后把早饭一口一口地喂给他吃，吃不完不准起这个床。
                等向晚换好衣服准备去字节工作啦，我就要抱上索一个吻💋，顺便把针孔跟踪器放在她袖子内侧；接着我就会在家里拿向晚赚的钱思考今天做什么样的晚饭才能让向晚健康地活下去。
                到了中午不停微信轰炸向晚，让他把午饭的样子拍下来发给我。如果不健康我就带着自己做的盒饭去单位揪他耳朵，接着拉到没什么人的地方惩❤️罚向晚，最后也是看着他吃完才放心离开。
                晚上是最难熬的。作为向晚妻子的我只能看着电脑屏幕里虚拟的她对观众们像个小恶魔一样撒娇，只能抱住滚烫的笔记本才能感觉得到向晚的温度。等过了晚上十点他可能会被同事们送回来，也许带点酒气，也许在外面吃饱了，但我还是会等他有空的时候强迫他喝下今天煮的汤，最后抱住疲惫不堪的他洗一个鸳鸯浴，我们像一张油画溶解在热水里，鲜艳的色彩叠在一起只剩下墨黑一片。
                把向晚丢在床上，靠在旁边听他说说今天的故事，故事可能是今天直播里已经讲过的，但我不会觉得厌倦，听到向晚和我说话就够了，牵着向晚的手五指紧握，闭上眼今天也全是向晚，真希望日复一日的生活不会被打乱，我是她的虚拟观众，他是我的现实老公❤️
            </div>
        </div>
    </div>
</template>

<script lang="ts">
import axios from 'axios'
import { defineComponent } from 'vue'
import { useRoute } from 'vue-router'
import { httpURL } from '@/common'
import { reactive, toRefs } from "vue";
import { Article } from '@/common'
axios.defaults.baseURL = httpURL
export default defineComponent({
    setup() {
        const title = "这是标题"
        const main_part = "这是正文"
        const author = "这是作者"
        const route = useRoute()
        const data = reactive({
            article: new Article(),
            authorName: ''
        })
        axios.get("article/getArticleByAid?aid=" + route.query.aid)
            .then((response) => {
                data.article = response.data
                axios.get("user/getUserByUid?uid=" + data.article.uid)
                    .then((response) => {
                        data.authorName = response.data.username
                    })
                    .catch((error) => {
                        console.log(error)
                    })
            })
            .catch((error) => {
                console.log(error)
            })
        return {
            title,
            main_part,
            author,
            ...toRefs(data)
        }
    }
})
</script>

<style scoped>
#big_box {
    width: 70%;
    height: 100%;
    display: flex;
    flex-direction: column;
    justify-content: center;
    align-items: center;
    margin-left: auto;
    margin-right: auto;
    background-color: white;
    color: black;
    border-radius: 10px;
    margin-top: 5px;
}
</style>